src/Reports/ГП_ОтчетПоШифрам1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ГП_ОтчетПоШифрам1</Name>
			<Comment>// Гарант+</Comment>
		</Properties>
	</Report>
</MetaDataObject>

src/AccumulationRegisters/РеализацияУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияУслуг</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/Reports/ГП_ОтчетПоШифрам1/Ext/ObjectModule.bsl
// Гарант+ Килипенко 05.11.2024 [F00230266] Отчет по шифрам ++
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;

    ИнициализироватьПараметры();

    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных,
            ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);

    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    МВТ = Новый МенеджерВременныхТаблиц;

    // Гарант+ Килипенко 15.06.2026 [F00253350] Отчет по шифрам - сопоставление л/с ++
    
    ИспПараметры = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
    ЗаполнитьВременныеТаблицыОтчета(МВТ,
        БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(ИспПараметры, "НачалоПериода").Значение,
        БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(ИспПараметры, "КонецПериода").Значение,
        Новый Структура("Организация, СписокНоменклатурныхГрупп",
                БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(ИспПараметры, "Организация").Значение,
                БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(ИспПараметры, "СписокНоменклатурныхГрупп").Значение));
    
    // Гарант+ Килипенко 15.06.2026 [F00253350] Отчет по шифрам - сопоставление л/с --
    
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина, Истина, МВТ);

    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

// Гарант+ Килипенко 05.11.2024 [F00230266] Отчет по шифрам --

// Гарант+ Килипенко 05.11.2024 [F00230266] Отчет по шифрам ++
#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьПараметры()
    // Установка границ периода отчета
    УточнитьПараметрыПериодаОтчета();

    НомГруппаВодоотведение = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НомГруппаВодоотведение");
    НомГруппаВодоотведение.Значение = Справочники.НоменклатурныеГруппы.НайтиПоКоду("0000002", Истина); // Водоотведение
    НомГруппаВодоотведение.Использование = Истина;

    НоменклатураВодоотведение = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НоменклатураВодоотведение");
    НоменклатураВодоотведение.Значение = Справочники.Номенклатура.НайтиПоКоду("00-00000007", Ложь); // Водоотведение (номенклатура)
    НоменклатураВодоотведение.Использование = Истина;

    НомГруппаВодоснабжение = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НомГруппаВодоснабжение");
    НомГруппаВодоснабжение.Значение =
        Справочники.НоменклатурныеГруппы.НайтиПоКоду("0000001", Истина); // Водоснабжение
    НомГруппаВодоснабжение.Использование = Истина;

    СписокНомГруппНВ = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СписокНомГруппНВ");
    СписокНомГруппНВ.Значение = Новый СписокЗначений;
    СписокНомГруппНВ.Значение.Добавить(
        Справочники.НоменклатурныеГруппы.НайтиПоКоду(
            "0000158", Истина)); // Негативное воздействие
    СписокНомГруппНВ.Использование = Истина;

    НоменклатураХВС = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НоменклатураХВС");
    НоменклатураХВС.Значение =
        Справочники.Номенклатура.НайтиПоКоду("00-00000003", Ложь); // Холодное водоснабжение (номенклатура)
    НоменклатураХВС.Использование = Истина;

    УслугаПотериВоды = ГП_РаботаСУслугами.ПолучитьУслугуПотериВоды().Ссылка;
    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
        ЭтотОбъект.КомпоновщикНастроек.Настройки, "НоменклатураПотериВоды", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УслугаПотериВоды, "Услуга"));

    НомГруппаНВ = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НомГруппаНВ");
    НомГруппаНВ.Значение =
        Справочники.НоменклатурныеГруппы.НайтиПоКоду("0000158", Истина); // Негативное воздействие
    НомГруппаНВ.Использование = Истина;

    СписокНоменклатурныхГрупп = Новый СписокЗначений;
    СписокНоменклатурныхГрупп.Добавить(НомГруппаВодоснабжение.Значение);
    СписокНоменклатурныхГрупп.Добавить(НомГруппаВодоотведение.Значение);
    СписокНоменклатурныхГрупп.Добавить(НомГруппаНВ.Значение); // Добавлено по изм. ТЗ

    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
        ЭтотОбъект.КомпоновщикНастроек.Настройки, "СписокНоменклатурныхГрупп", СписокНоменклатурныхГрупп);
КонецПроцедуры

Функция УточнитьПараметрыПериодаОтчета()
    РезультатФункции = Новый Структура("ДатаНачала, ДатаОкончания", Дата(1, 1, 1), Дата(1, 1, 1));

    ПараметрПериодОтчета =
        БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(ЭтотОбъект.КомпоновщикНастроек, "ПериодОтчета");

    РезультатФункции.ДатаНачала = НачалоДня(ПараметрПериодОтчета.Значение.ДатаНачала);
    РезультатФункции.ДатаОкончания = КонецДня(ПараметрПериодОтчета.Значение.ДатаОкончания);

    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
        ЭтотОбъект.КомпоновщикНастроек.Настройки, "НачалоПериодаГраница", Новый Граница(РезультатФункции.ДатаНачала, ВидГраницы.Включая));
    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
        ЭтотОбъект.КомпоновщикНастроек.Настройки, "КонецПериодаГраница", Новый Граница(РезультатФункции.ДатаОкончания, ВидГраницы.Включая));
        
    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
        ЭтотОбъект.КомпоновщикНастроек.Настройки, "НачалоПериода", РезультатФункции.ДатаНачала);
    БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
        ЭтотОбъект.КомпоновщикНастроек.Настройки, "КонецПериода", РезультатФункции.ДатаОкончания);

    Возврат РезультатФункции;
КонецФункции

// Устарела. Временное решение проблемы отсутствия полей / регистров в расширении - в версии платформы 29 проблема должна быть решена
//
Процедура Удалить_ПодготовитьТекстЗапроса()
    ТекстЗапроса = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос;

    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВТ_ДинамическиеПоказателиЛицевыхСчетов###",
            "РегистрСведений.lc_ДинамическиеПоказателиЛицевыхСчетов.СрезПоследних(&КонецПериодаГраница, )");

    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВТ_СоответствияНазначенийПлатежей###",
            "РегистрСведений.ГП_СоответствияНазначенийПлатежей.СрезПоследних(&КонецПериодаГраница, )");

    СимволыКонцаВЫражения = "(?:[\s\n\r]+)";
    ТекстЗапроса = СтрЗаменитьПоРегулярномуВыражению(ТекстЗапроса,
            "(?m)\(?ВТ_Результат.Водозабор = &Водозабор\)?," + СимволыКонцаВЫражения
            + "\(?ВТ_Результат.Контролер = &Контролер\)?," + СимволыКонцаВЫражения
            + "\(?ВТ_Результат.Договородержатель = &Договородержатель\)?," + СимволыКонцаВЫражения
            + "\(?ВТ_Результат.Финансирование = &Финансирование\)?," + СимволыКонцаВЫражения
            + "\(?ВТ_Результат.ВидПотребления = &ВидПотребления\)?," + СимволыКонцаВЫражения,

            "(ВЫРАЗИТЬ(ВТ_Результат.Водозабор КАК Справочник.lc_Водозаборы)) = &Водозабор,
            |   (ВЫРАЗИТЬ(ВТ_Результат.Контролер КАК Справочник.lc_Контролеры)) = &Контролер,
            |   (ВЫРАЗИТЬ(ВТ_Результат.Договородержатель КАК Справочник.lc_Контролеры)) = &Договородержатель,
            |   (ВЫРАЗИТЬ(ВТ_Результат.Финансирование КАК Справочник.lc_СпособыФинансирования)) = &Финансирование,
            |   (ВЫРАЗИТЬ(ВТ_Результат.ВидПотребления КАК Справочник.lc_ГруппыПотребителей)) = &ВидПотребления,
            |");

    ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = ТекстЗапроса;
КонецПроцедуры

// Гарант+ Килипенко 15.06.2026 [F00253350] Отчет по шифрам - сопоставление л/с ++
//
Функция ЗаполнитьВременныеТаблицыОтчета(МВТ, Знач НачалоПериода, Знач КонецПериода, Знач Отбор)	
    Запрос = Новый Запрос;
    Запрос.Текст =
        "
        |////////////////////////////////////////////////////////////////////////////////
        |// [0]
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |    РеализацияУслуг.Период КАК Период,
        |    РеализацияУслуг.НомерСтроки КАК НомерСтроки,
        |    РеализацияУслуг.Регистратор КАК Регистратор,
        |    ЕСТЬNULL(РеализацияУслуг.Организация, НЕОПРЕДЕЛЕНО) КАК Организация,
        |    РеализацияУслуг.СчетРасходов КАК СчетРасходов,
        |    РеализацияУслуг.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
        |    ЕСТЬNULL(РеализацияУслуг.Подразделение, НЕОПРЕДЕЛЕНО) КАК Подразделение,
        |    РеализацияУслуг.Услуга КАК Услуга,
        |    РеализацияУслуг.Сумма КАК Сумма
        |ПОМЕСТИТЬ ВТ_Реализация
        |ИЗ
        |    РегистрНакопления.РеализацияУслуг КАК РеализацияУслуг
        |ГДЕ
        |    РеализацияУслуг.Период >= &НачалоПериода
        |    И РеализацияУслуг.Период <= &КонецПериода
        |    И РеализацияУслуг.Активность = ИСТИНА
        |    И РеализацияУслуг.Организация = &Организация
        |    И РеализацияУслуг.НоменклатурнаяГруппа В(&СписокНоменклатурныхГрупп)
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |// [1]
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |    Хозрасчетный.Период КАК Период,
        |    Хозрасчетный.НомерСтроки КАК НомерСтроки,
        |    Хозрасчетный.УточнениеПериода КАК УточнениеПериода,
        |    Хозрасчетный.Регистратор КАК Регистратор,
        |    Хозрасчетный.СчетДт КАК Счет,
        |    ВЫРАЗИТЬ(Хозрасчетный.СубконтоКт1 КАК Справочник.НоменклатурныеГруппы) КАК НоменклатурнаяГруппа,
        |    Хозрасчетный.СубконтоКт2 КАК СтавкаНДС,
        |    Хозрасчетный.СубконтоКт3 КАК Номенклатура,
        |    ЕСТЬNULL(Хозрасчетный.Организация, НЕОПРЕДЕЛЕНО) КАК Организация,
        |    ЕСТЬNULL(Хозрасчетный.ВалютаДт, НЕОПРЕДЕЛЕНО) КАК Валюта,
        |    ЕСТЬNULL(Хозрасчетный.ПодразделениеДт, НЕОПРЕДЕЛЕНО) КАК Подразделение,
        |    Хозрасчетный.СчетКт КАК КорСчет,
        |    ВЫРАЗИТЬ(Хозрасчетный.СубконтоДт1 КАК Справочник.Контрагенты) КАК Контрагент,
        |    ВЫРАЗИТЬ(Хозрасчетный.СубконтоДт2 КАК Справочник.ДоговорыКонтрагентов) КАК Договор,
        |    Хозрасчетный.СубконтоДт3 КАК ДокументРеализации,
        |    Хозрасчетный.Сумма КАК Сумма,
        |    Хозрасчетный.СуммаНУКт КАК СуммаНУ,
        |    Хозрасчетный.Сумма - Хозрасчетный.СуммаНУКт КАК СуммаНДС,
        |    Хозрасчетный.КоличествоКт КАК Количество,
        |    Хозрасчетный.Содержание КАК Содержание,
        |	 АВТОНОМЕРЗАПИСИ() КАК АвтоНомер
        |ПОМЕСТИТЬ ВТ_БУРеализация
        |ИЗ
        |    РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(&НачалоПериодаГраница, &КонецПериодаГраница, , , ) КАК Хозрасчетный
        |ГДЕ
        |	СубконтоКт1 ССЫЛКА Справочник.НоменклатурныеГруппы
        |	И СубконтоКт2 ССЫЛКА Перечисление.СтавкиНДС
        |	И СубконтоКт3 ССЫЛКА Справочник.Номенклатура
        |	И СубконтоДт1 ССЫЛКА Справочник.Контрагенты
        |	И СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
        |    И (ЕСТЬNULL(Хозрасчетный.Организация, НЕОПРЕДЕЛЕНО), Хозрасчетный.СубконтоДт3) В
        |            (ВЫБРАТЬ РАЗЛИЧНЫЕ
        |                Т.Организация,
        |                Т.Регистратор
        |            ИЗ
        |                ВТ_Реализация КАК Т)
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |// [2]
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |    РеализацияУслуг.Ссылка КАК Ссылка,
        |    РеализацияУслуг.Номенклатура КАК Номенклатура,
        |    ЕСТЬNULL(РеализацияУслуг.Ссылка.Организация, НЕОПРЕДЕЛЕНО) КАК Организация,
        |    РеализацияУслуг.Содержание КАК Содержание,
        |    РеализацияУслуг.Количество КАК Количество,
        |    РеализацияУслуг.Сумма КАК Сумма,
        |    РеализацияУслуг.СтавкаНДС КАК СтавкаНДС,
        |    РеализацияУслуг.СуммаНДС КАК СуммаНДС,
        |    РеализацияУслуг.СчетДоходов КАК СчетДоходов,
        |    РеализацияУслуг.Субконто КАК Субконто,
        |    РеализацияУслуг.СчетУчетаНДСПоРеализации КАК СчетУчетаНДСПоРеализации,
        |    РеализацияУслуг.СчетРасходов КАК СчетРасходов,
        |    РеализацияУслуг.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю,
        |	 АВТОНОМЕРЗАПИСИ() КАК АвтоНомер
        |ПОМЕСТИТЬ ВТ_РеализацияУслуг
        |ИЗ
        |    Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияУслуг
        |ГДЕ
        |    (ЕСТЬNULL(РеализацияУслуг.Ссылка.Организация, НЕОПРЕДЕЛЕНО), РеализацияУслуг.Ссылка) В
        |            (ВЫБРАТЬ
        |                Т.Организация,
        |                Т.ДокументРеализации
        |            ИЗ
        |                ВТ_БУРеализация КАК Т)
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |// [3]
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |    ВТ_БУРеализация.Период КАК Период,
        |    ВТ_БУРеализация.НомерСтроки КАК НомерСтроки,
        |    ВТ_БУРеализация.УточнениеПериода КАК УточнениеПериода,
        |    ВТ_БУРеализация.Регистратор КАК Регистратор,
        |    ВТ_БУРеализация.Счет КАК Счет,
        |    ВТ_БУРеализация.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
        |    ВТ_БУРеализация.СтавкаНДС КАК СтавкаНДС,
        |    ВТ_БУРеализация.Номенклатура КАК Номенклатура,
        |    ВТ_БУРеализация.Организация КАК Организация,
        |    ВТ_БУРеализация.Валюта КАК Валюта,
        |    ВТ_БУРеализация.Подразделение КАК Подразделение,
        |    ВТ_БУРеализация.КорСчет КАК КорСчет,
        |    ВТ_БУРеализация.Контрагент КАК Контрагент,
        |    ВТ_БУРеализация.Договор КАК Договор,
        |    ВТ_БУРеализация.ДокументРеализации КАК ДокументРеализации,
        |    ВТ_БУРеализация.Сумма КАК Сумма,
        |    ВТ_БУРеализация.СуммаНУ КАК СуммаНУ,
        |    ВТ_БУРеализация.СуммаНДС КАК СуммаНДС,
        |    ВТ_БУРеализация.Количество КАК Количество,
        |    ЕСТЬNULL(ВТ_РеализацияУслуг.Содержание, ""<>"") КАК Содержание,
        |    АВТОНОМЕРЗАПИСИ() КАК АвтоНомер,
        |	 ЕСТЬNULL(ВТ_БУРеализация.АвтоНомер, -1) КАК АвтоНомер_БУРеализация,
        |	 ЕСТЬNULL(ВТ_РеализацияУслуг.АвтоНомер, -1) КАК АвтоНомер_Реализация
        |ПОМЕСТИТЬ ВТ_БУРеализацияИСодержаниеПодготовка
        |ИЗ
        |    ВТ_БУРеализация КАК ВТ_БУРеализация
        |        ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеализацияУслуг КАК ВТ_РеализацияУслуг
        |        ПО ВТ_БУРеализация.ДокументРеализации = ВТ_РеализацияУслуг.Ссылка
        |            И ВТ_БУРеализация.Организация = ВТ_РеализацияУслуг.Организация
        |            И ВТ_БУРеализация.КорСчет = ВТ_РеализацияУслуг.СчетДоходов
        |            И ВТ_БУРеализация.СтавкаНДС = ВТ_РеализацияУслуг.СтавкаНДС
        |            И ВТ_БУРеализация.НоменклатурнаяГруппа = ВТ_РеализацияУслуг.Субконто
        |            И ВТ_БУРеализация.Номенклатура = ВТ_РеализацияУслуг.Номенклатура
        |            И ВТ_БУРеализация.СуммаНУ = ВТ_РеализацияУслуг.Сумма
        |            И ВТ_БУРеализация.СуммаНДС = ВТ_РеализацияУслуг.СуммаНДС
        |            И ВТ_БУРеализация.Количество = ВТ_РеализацияУслуг.Количество
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |// [4]
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |    БУРеализация.Период КАК Период,
        |    БУРеализация.НомерСтроки КАК НомерСтроки,
        |    БУРеализация.УточнениеПериода КАК УточнениеПериода,
        |    БУРеализация.Регистратор КАК Регистратор,
        |    БУРеализация.Счет КАК Счет,
        |    БУРеализация.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
        |    БУРеализация.СтавкаНДС КАК СтавкаНДС,
        |    БУРеализация.Номенклатура КАК Номенклатура,
        |    БУРеализация.Организация КАК Организация,
        |    БУРеализация.Валюта КАК Валюта,
        |    БУРеализация.Подразделение КАК Подразделение,
        |    БУРеализация.КорСчет КАК КорСчет,
        |    БУРеализация.Контрагент КАК Контрагент,
        |    БУРеализация.Договор КАК Договор,
        |    БУРеализация.ДокументРеализации КАК ДокументРеализации,
        |    БУРеализация.Сумма КАК Сумма,
        |    БУРеализация.СуммаНУ КАК СуммаНУ,
        |    БУРеализация.СуммаНДС КАК СуммаНДС,
        |    БУРеализация.Количество КАК Количество,
        |    БУРеализация.Содержание КАК Содержание,
        |    БУРеализация.АвтоНомер КАК АвтоНомер,
        |    БУРеализация.АвтоНомер_БУРеализация КАК АвтоНомер_БУРеализация,
        |    БУРеализация.АвтоНомер_Реализация КАК АвтоНомер_Реализация
        |ИЗ
        |    ВТ_БУРеализацияИСодержаниеПодготовка КАК БУРеализация
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |// [5]
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |    БУРеализация.Период КАК Период,
        |    БУРеализация.УточнениеПериода КАК УточнениеПериода,
        |    БУРеализация.Регистратор КАК Регистратор,
        |    БУРеализация.Счет КАК Счет,
        |    БУРеализация.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
        |    БУРеализация.СтавкаНДС КАК СтавкаНДС,
        |    БУРеализация.Номенклатура КАК Номенклатура,
        |    БУРеализация.Организация КАК Организация,
        |    БУРеализация.Валюта КАК Валюта,
        |    БУРеализация.Подразделение КАК Подразделение,
        |    БУРеализация.КорСчет КАК КорСчет,
        |    БУРеализация.Контрагент КАК Контрагент,
        |    БУРеализация.Договор КАК Договор,
        |    БУРеализация.ДокументРеализации КАК ДокументРеализации,
        |    БУРеализация.Сумма КАК Сумма,
        |    БУРеализация.СуммаНУ КАК СуммаНУ,
        |    БУРеализация.СуммаНДС КАК СуммаНДС,
        |    БУРеализация.Количество КАК Количество,
        |	 КОЛИЧЕСТВО(БУРеализация.Содержание) КАК КоличествоСодержаний
        |ИЗ
        |    ВТ_БУРеализацияИСодержаниеПодготовка КАК БУРеализация
        |
        |СГРУППИРОВАТЬ ПО
        |	 БУРеализация.ДокументРеализации,
        |    БУРеализация.Организация,
        |    БУРеализация.Контрагент,
        |    БУРеализация.Договор,
        |    БУРеализация.Счет,
        |    БУРеализация.КорСчет,
        |    БУРеализация.СтавкаНДС,
        |    БУРеализация.НоменклатурнаяГруппа,
        |    БУРеализация.Номенклатура,
        |    БУРеализация.Валюта,
        |    БУРеализация.Подразделение,
        |    БУРеализация.Сумма,
        |    БУРеализация.СуммаНУ,
        |    БУРеализация.СуммаНДС,
        |    БУРеализация.Количество,
        |    БУРеализация.Регистратор,
        |    БУРеализация.Период,
        |    БУРеализация.УточнениеПериода
        |	
        |ИМЕЮЩИЕ
        |	КОЛИЧЕСТВО(БУРеализация.Содержание) > 1
        |";
    
    НачалоПериода = НачалоДня(НачалоПериода);
    Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
    Запрос.УстановитьПараметр("НачалоПериодаГраница", Новый Граница(НачалоПериода, ВидГраницы.Включая));
    
    КонецПериода = КонецДня(КонецПериода);
    Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
    Запрос.УстановитьПараметр("КонецПериодаГраница", Новый Граница(КонецПериода, ВидГраницы.Включая));
    
    Запрос.УстановитьПараметр("Организация", Отбор.Организация);
    Запрос.УстановитьПараметр("СписокНоменклатурныхГрупп", Отбор.СписокНоменклатурныхГрупп);
    
    РезПакет = Запрос.ВыполнитьПакет();
    
    ТабЗадвоениеСодержания = РезПакет[РезПакет.Количество() - 1].Выгрузить();
    ТабРеализация = РезПакет[РезПакет.Количество() - 2].Выгрузить();
    
    КэшОбработанныхСтрока = Новый Соответствие;
    СтрокиРеализацииДляУдаления = Новый Массив;
    КлючиОтбора = "ДокументРеализации, Организация, Договор, Счет, КорСчет, СтавкаНДС, НоменклатурнаяГруппа"
        + ", Номенклатура, Валюта, Подразделение, Сумма, СуммаНУ, СуммаНДС, Количество, Регистратор, Период, УточнениеПериода";
    Для Каждого ТекСтрСодержание Из ТабЗадвоениеСодержания Цикл
        ТекОтбор = Новый Структура(КлючиОтбора);
        ЗаполнитьЗначенияСвойств(ТекОтбор, ТекСтрСодержание);
        НайдСтроки = ТабРеализация.НайтиСтроки(ТекОтбор);
        
        КэшТекДанных = Новый Соответствие;
        Для Каждого ТекСтрРеализации Из НайдСтроки Цикл
            КлючТекСтроки = ТекСтрРеализации.АвтоНомер_Реализация;
            Если КэшТекДанных.Получить(КлючТекСтроки) <> Неопределено Тогда
                СтрокиРеализацииДляУдаления.Добавить(ТекСтрРеализации);
                Продолжить;
            Иначе
                КэшТекДанных.Вставить(КлючТекСтроки, Истина);
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;
    
    Для Каждого СтрУдаления Из СтрокиРеализацииДляУдаления Цикл
        ТабРеализация.Удалить(СтрУдаления);
    КонецЦикла;
    
    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = МВТ;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |    Реализация.Период КАК Период,
        |    Реализация.НомерСтроки КАК НомерСтроки,
        |    Реализация.УточнениеПериода КАК УточнениеПериода,
        |    Реализация.Регистратор КАК Регистратор,
        |    Реализация.Счет КАК Счет,
        |    Реализация.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
        |    Реализация.СтавкаНДС КАК СтавкаНДС,
        |    Реализация.Номенклатура КАК Номенклатура,
        |    Реализация.Организация КАК Организация,
        |    Реализация.Валюта КАК Валюта,
        |    Реализация.Подразделение КАК Подразделение,
        |    Реализация.КорСчет КАК КорСчет,
        |    Реализация.Контрагент КАК Контрагент,
        |    Реализация.Договор КАК Договор,
        |    Реализация.ДокументРеализации КАК ДокументРеализации,
        |    Реализация.Сумма КАК Сумма,
        |    Реализация.СуммаНУ КАК СуммаНУ,
        |    Реализация.СуммаНДС КАК СуммаНДС,
        |    Реализация.Количество КАК Количество,
        |    Реализация.Содержание КАК Содержание,
        |    Реализация.АвтоНомер КАК АвтоНомер
        //|    Реализация.АвтоНомер_БУРеализация КАК АвтоНомер_БУРеализация,
        //|    Реализация.АвтоНомер_Реализация КАК АвтоНомер_Реализация
        |ПОМЕСТИТЬ ВТ_БУРеализацияИСодержаниеВнешний
        |ИЗ
        |    &ТабРеализация КАК Реализация
        |";
    
    Запрос.УстановитьПараметр("ТабРеализация", ТабРеализация);
    Запрос.Выполнить();
КонецФункции // Гарант+ Килипенко 15.06.2026 [F00253350] Отчет по шифрам - сопоставление л/с ++

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 05.11.2024 [F00230266] Отчет по шифрам --
